Repository: AhmedKhairyM0/HaslTy
Catalog: lib/l10n/app_*.arb
Languages: ar

# addExpensePageTitle
source: Add Expense
ar: إضافة نفقة

source: Alert!!!
ar: تحذير!!!

# appName
source: Expense Tracker
ar: مراقب النفقات

# balanceLabel
source: Weekly balance
ar: رصيدك المالي الاسبوعي

source: Cancle
ar: إلغاء

source: Choose date
ar: أختار تاريخ

# contentAlertDialog
source: Your balance is {balance}
ar: رصيدك المالي {balance}

# contentDeleteDialog
source: Do you certain delete {expenseTitle}?
ar: هل انت متأكد من حذف {expenseTitle}؟

# contentReportBugs
source: Please, report the error to developers for maintenance
ar: من فضبلك اخبر مطوري التطبيق عن الخطأ

source: Delete
ar: حذف

# discardContent
source: Discarded
ar: تم تجاهل هذه النفقات

# editExpensePageTitle
source: Edit Expense
ar: تعديل علي نفقات

# emptyDate
source: No chosen date
ar: لم تختار تاريخ بعد

# emptyExpense
source: No expenses yet ðŸ¤‘
ar: لا يوجد نفقات حتي الان 🤑

# expenseAmount
source: Amount
ar: الكمية

# expenseTitle
source: Title
ar: فيما انفق

# formattedErrorMessage
source: Allowed input: numbers [0..9]
ar: الارقام فقد المسموح بها (0-9)

# homePageTitle
source: My balance {balance}
ar: رصيدي {balance}

# alertNotFormattedNumber
source: The number must be more than zero
ar: الكمية قيمته يجب ان تكون اكير من الصفر

source: Report
ar: إعلام المبرمجين

# resetExpense
source: Reset expenses
ar: إعادة ضبط النفقات

source: Skip
ar: تخطئ

# titleDeleteDialog
source: Delete this week's expenses and start keeping track of another week's expenses ðŸ¤‘
ar: احذف نفقات هذا الأسبوع وابدأ في تتبع نفقات أسبوع آخر 🤑

# titleReportBugs
source: Sudden error!!
ar: خطأ مفاجئ

# trackBalance
source: Track your balance
ar: راقب رصيدك

# disableAddExpense
source: Sorry, you don't have en
ar: للاسف ليس لديك رصيد

source: Choose language
ar: اختار اللغة

# addBalance
source: Add current balance
ar: أضف رصيدك الحالي

source: Contact us
ar: تواصل معنا

# noMoney
source: Sorry, you don't have money You must start to save some money later
ar: للاسف ليست لديك مال الان يجب أن تبدا بتوفير بعص المال لاحقا

source: Choose preferred theme
ar: أختار اللون المفضل لك
